app/views/shared/_comment.html.erb

    <hr>
    <p><%= comment.user.first_name %><small><em><%= "#{time_ago_in_words(comment.created_at)} ago" %></em></small>
---
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "fgfgfgfgf"], ["rating", 3], ["product_id", 2], ["user_id", 1], ["created_at", "2016-04-26 06:55:04.365124"], ["updated_at", "2016-04-26 06:55:04.365124"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]