app/controllers/comments_controller.rb

  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    respond_to do |format|
     if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Great guitar !"], ["rating", 4], ["product_id", 1], ["user_id", 1], ["created_at", "2016-04-17 08:19:01.802391"], ["updated_at", "2016-04-17 08:19:01.802391"]]