app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("total") VALUES (?)  [["total", 354.0]]
---
	def create

		@product = Product.find(params[:product_id])
		@user = current_user
		token = params[:stripeToken]
  # Create the charge on Stripe's servers - this will charge the user's card
  begin
    charge = Stripe::Charge.create(
      :amount => 345, # amount in cents, again
      :currency => "usd",
      :source => token,
      :description => "Example charge...."
    )

    if charge.paid
    	Order.create(product_id: @product, user_id: @user, total: 345 )