app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.where("name LIKE ?", "%#{search_term}")
    else
      @products = Product.all #in params #2 exercise, it is not product.limit(3) anymore
---
SELECT "products".* FROM "products"
SELECT MAX("products"."updated_at") FROM "products"

  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 2)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 2 OFFSET 0  [["product_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "gfgfg"], ["description", "fgfgfgfg"], ["image_url", ""], ["color", "blue"], ["created_at", "2016-04-16 21:04:48.654932"], ["updated_at", "2016-04-16 21:04:48.654932"]]